In [1]:
# Task - Create a dataframe including emp_id, emp_name and emp_salary.
# Get single and multiple columns
# Swap the columns
# Convert all the columns into lower and upper case 
# Add new columns based on some condition
# Delete all the newly added columns
# Give the 10% increment to all the employees

In [2]:
import pandas as pd

In [3]:
# Creating the data frame

emp_data = {
    'emp_id': [101,102,103,104,105,106],
    'emp_name': ['Teja', 'Ram', 'Sam', 'Avi', 'Tara', 'Anu'],
    'emp_salary': [50000,45000,35000,41500,31640,46660]
}
df = pd.DataFrame(emp_data)
df

   emp_id emp_name  emp_salary
0     101     Teja       50000
1     102      Ram       45000
2     103      Sam       35000
3     104      Avi       41500
4     105     Tara       31640
5     106      Anu       46660

In [4]:
# Get single and multiple columns

print(f'Single column:\n{df.emp_id}')
print(f'\nMulyiple columns:\n{df[['emp_name', 'emp_salary']]}')

Single column:
0    101
1    102
2    103
3    104
4    105
5    106
Name: emp_id, dtype: int64

Mulyiple columns:
  emp_name  emp_salary
0     Teja       50000
1      Ram       45000
2      Sam       35000
3      Avi       41500
4     Tara       31640
5      Anu       46660

In [5]:
# Swap the columns

df = df[['emp_name', 'emp_id', 'emp_salary']]
df

  emp_name  emp_id  emp_salary
0     Teja     101       50000
1      Ram     102       45000
2      Sam     103       35000
3      Avi     104       41500
4     Tara     105       31640
5      Anu     106       46660

In [6]:
# Convert all the columns into lower and upper case 

df.columns = df.columns.str.upper()  #Upper case
df

  EMP_NAME  EMP_ID  EMP_SALARY
0     Teja     101       50000
1      Ram     102       45000
2      Sam     103       35000
3      Avi     104       41500
4     Tara     105       31640
5      Anu     106       46660

In [7]:
df.columns = df.columns.str.lower()  #Lower case
df

  emp_name  emp_id  emp_salary
0     Teja     101       50000
1      Ram     102       45000
2      Sam     103       35000
3      Avi     104       41500
4     Tara     105       31640
5      Anu     106       46660

In [8]:
# Add new columns based on some condition

df[df['emp_salary'] > 43000]

  emp_name  emp_id  emp_salary
0     Teja     101       50000
1      Ram     102       45000
5      Anu     106       46660

In [9]:
# Delete all the newly added columns

df.drop(['emp_salary'], axis=1)

  emp_name  emp_id
0     Teja     101
1      Ram     102
2      Sam     103
3      Avi     104
4     Tara     105
5      Anu     106

In [13]:
# Give the 10% increment to all the employees

df['emp_salary'] = df['emp_salary'] * 1.10

In [14]:
df

  emp_name  emp_id  emp_salary
0     Teja     101     55000.0
1      Ram     102     49500.0
2      Sam     103     38500.0
3      Avi     104     45650.0
4     Tara     105     34804.0
5      Anu     106     51326.0